[
    {
       "name":"M Benz S-Class",
       "img":"https://www.ccarprice.com/products/Mercedes-Benz-S-Class-S-560e-Sedan-2020_1.jpg",
       "details":"The Mercedes-Benz S-Class, formerly known as Sonderklasse (German for \"special class\", abbreviated as \"S-Klasse\"), is a series of full-sized luxury sedans, limousines and armored sedans produced by the German automaker Mercedes-Benz, a division of German company Daimler AG. The S-Class is the designation for top-of-the-line Mercedes-Benz models and was officially introduced in 1972 with the W116, and has remained in use ever since. The S-Class is the flagship vehicle for Mercedes-Benz.",
       "price":" $ 109,800"
    },
    {
       "name":"Audi E-tron Quattro",
       "img":"https://www.ccarprice.com/products/Audi_e-tron_Prestige_quattro_2021.jpg",
       "details":"The Audi e-tron is an all-electric, midsize luxury[3] crossover produced by Audi, which was unveiled as a concept car at the 2015 Frankfurt Motor Show. It is the companys first electric mass production car, and was first delivered in May 2019. It has an EPA range of 204 miles (328 km), or 222 miles (357 km) in the updated model.",
       "price":" $ 65,900"
    },
    {
       "name":"Range Rover",
       "img":"https://prod.static9.net.au/fs/aa73ec07-dfb1-410f-8641-f1e5a66220f2",
       "details":"The Land Rover Range Rover (generally known simply as the Range Rover) is a 4x4 motor car produced by Land Rover, a marque and sub-brand of Jaguar Land Rover. The Range Rover line was launched in 1970 by British Leyland and is now in its fourth generation.The Land Rover Range Rover (generally known simply as the Range Rover) is a 4x4 motor car produced by Land Rover, a marque and sub-brand of Jaguar Land Rover.",
       "price":" $ 100,000"
    },
    {
       "name":"Mercedes CLS",
       "img":"https://cdn.motor1.com/images/mgl/gYGM8/s1/2022-mercedes-benz-cls-450-4matic-front-corner.jpg",
       "details":"The Mercedes-Benz CLS-Class is a series of executive cars produced by Mercedes-Benz since 2004.The original model was a four-door fastback sedan based on the Mercedes E-Class platform, marketed as a four door coupé.[1] An estate (Shooting Brake) model was later added to the model range with the second generation CLS.[2] All models are available as a high performance AMG variant, although it wasnt until the second generation CLS that 4MATIC all-wheel drive was offered",
       "price":" $ 70,300"
    },
    {
       "name":"BMW 7 Series",
       "img":"https://www.topgear.com/sites/default/files/cars-car/carousel/2019/04/bmw_750li_xdrive_19.jpg",
       "details":"The BMW 7 Series is a full-size luxury sedan produced by the German automaker BMW since 1977.[1] It is the successor to the BMW E3 \"New Six\" sedan and is currently in its sixth generation.The 7 Series is BMWs flagship car and is only available in a sedan bodystyle (including long wheelbase and limousine models). It traditionally introduces technologies and exterior design themes before they trickle down to other models in BMWs lineup.",
       "price":" $ 86,800"
    },
    {
       "name":"BMW X7",
       "img":"https://mediapool.bmwgroup.com/cache/P9/201810/P90326038/P90326038-the-first-ever-bmw-x7-with-design-pure-excellence-in-arctic-grey-light-alloy-wheels-styling-757-10-2-2248px.jpg",
       "details":"The BMW X7 is a full-sized luxury sport utility vehicle manufactured by BMW. It is BMWs flagship SUV, and the largest and most expensive in its line-up.The X7 was first announced by BMW in March 2014.[3] It was officially unveiled on October 17, 2018, with pre-orders being taken online. The X7 has been available at dealers since March 2019.",
       "price":" $ 74,900"
    },
    {
       "name":"Audi Q8",
       "img":"https://i.auto-bild.de/mdb/extra_large/99/q8-659.png",
       "details":"The Audi Q8 is a mid-size luxury crossover SUV coupé made by Audi that was launched in 2018.[4] It is the flagship of the Audi SUV line, and is being produced at the Volkswagen Bratislava Plant",
       "price":" $ 68,200"
    },
    {
       "name":"Lexus LS",
       "img":"https://media-eng.dhakatribune.com/uploads/2021/04/lexus-ls-1617599552804.jpg",
       "details":"The Lexus LS (Japanese: レクサス・LS, Rekusasu LS) is a full-size luxury sedan (F-segment in Europe) serving as the flagship model of Lexus, the luxury division of Toyota. For the first four generations, all LS models featured V8 engines and were predominantly rear-wheel-drive. In the fourth generation, Lexus offered all-wheel-drive, hybrid, and long-wheelbase variants. The fifth generation changed to using a V6 engine with no V8 option, and only one length was offered.",
       "price":" $ 76,000"
    },
    {
       "name":"Maserati Quattroporte",
       "img":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/2015_Maserati_Quattroporte_DV6_Automatic_3.0_Front.jpg/1200px-2015_Maserati_Quattroporte_DV6_Automatic_3.0_Front.jpg",
       "details":"The Maserati Quattroporte (Italian pronunciation: [ˌkwatroˈpɔrte]) is a four-door full-size luxury sports saloon produced by Italian automobile manufacturer Maserati. The name translated from Italian means \"four doors\". The car is currently in its sixth generation, with the first generation introduced in 1963.",
       "price":" $ 104,890"
    },
    {
       "name":"Bangla Car",
       "img":"https://hossaingroup.org/wp-content/uploads/2021/01/109857166_752364875540039_8004338618970031661_o-1024x1024.jpg",
       "details":"Bangla Cars Limited plans to build up a integrated base of production, marketing and service in Bangladesh in the early stage of the project, and achieve the sales volume to be 1,500 units of new cars within 3 years by building transparent production and 24 hours after-sales-service. Bangla cars Limited has already imported super cab, C35/C36, Glory S 560/580/i-auto in RHD & KD condition from DFSK, PT. SOKONINDO AUTOMOBILES, Jakarta, Indonesia and ZX/PZ2 pickup/SF6 SUV from KINGSTAR, Main land of China. ",
       "price":" $ 35,000"
    }
 ]